0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 200;

boundaryField
{
    INLET
    {
        type    turbulentMixingLengthDissipationRateInlet;
        mixingLength       12.7e-3;
        value           uniform 200;
    }
    OUTLET
    {
        type            zeroGradient;
    }
    WALL
    {
        type    epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
		value uniform 200;
    }

}


// ************************************************************************* //
